<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"435871e94fad836f156d1f06a0e513ccef2502901c3e9970034c971eee3b98f0","plan_job_ref":"Job Test actions using target and replace #512 at https://github.com/dflook/terraform-github-actions/actions/runs/15426294859","plan_out_hash":"4e45c3f6e3a532d5ad85f1ad6b9914f53c5db4c12d4d398cd1ee445816a38316","plan_hash":"435adb5b42d85b885521e2d755bb160f31aacbf68a689de65797367a297d6dc4","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "JfcW7s0vRP" -> (known after apply)
!~  foreach = "xJTAeN4gDi" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #512](https://github.com/dflook/terraform-github-actions/actions/runs/15426294859)